{"format": "layers-model", "generatedBy": "keras v2.11.0", "convertedBy": "TensorFlow.js Converter v4.4.0", "modelTopology": {"keras_version": "2.11.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_83", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 600, 24], "dtype": "float32", "sparse": false, "ragged": false, "name": "bidirectional_83_input"}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_83", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 600, 24], "layer": {"class_name": "LSTM", "config": {"name": "lstm_83", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}}, {"class_name": "Dense", "config": {"name": "dense_249", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_250", "trainable": true, "dtype": "float32", "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_251", "trainable": true, "dtype": "float32", "units": 3, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"loss": "sparse_categorical_crossentropy", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "categorical_accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Custom>Adam", "config": {"name": "Adam", "weight_decay": null, "clipnorm": null, "global_clipnorm": null, "clipvalue": null, "use_ema": false, "ema_momentum": 0.99, "ema_overwrite_frequency": null, "jit_compile": true, "is_legacy_optimizer": false, "learning_rate": 0.0010000000474974513, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "bidirectional_83/forward_lstm_83/lstm_cell_265/kernel", "shape": [24, 256], "dtype": "float32"}, {"name": "bidirectional_83/forward_lstm_83/lstm_cell_265/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_83/forward_lstm_83/lstm_cell_265/bias", "shape": [256], "dtype": "float32"}, {"name": "bidirectional_83/backward_lstm_83/lstm_cell_266/kernel", "shape": [24, 256], "dtype": "float32"}, {"name": "bidirectional_83/backward_lstm_83/lstm_cell_266/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_83/backward_lstm_83/lstm_cell_266/bias", "shape": [256], "dtype": "float32"}, {"name": "dense_249/kernel", "shape": [128, 64], "dtype": "float32"}, {"name": "dense_249/bias", "shape": [64], "dtype": "float32"}, {"name": "dense_250/kernel", "shape": [64, 32], "dtype": "float32"}, {"name": "dense_250/bias", "shape": [32], "dtype": "float32"}, {"name": "dense_251/kernel", "shape": [32, 3], "dtype": "float32"}, {"name": "dense_251/bias", "shape": [3], "dtype": "float32"}]}]}